## Segment 4 - Concatenating and transforming data

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [3]:
DF_obj = pd.DataFrame(np.arange(36).reshape(6,6))
DF_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [4]:
DF_obj_2 = pd.DataFrame(np.arange(15).reshape(5,3))
DF_obj_2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

### Concatenating data

In [5]:
 #merging of data
pd.concat([DF_obj,DF_obj_2],axis = 1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [7]:
#appending
pd.concat([DF_obj,DF_obj_2],axis = 0)

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

### Transforming data
#### Dropping data

In [8]:
d1= DF_obj.drop([0, 2])   #inplace=False by default
d1

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [9]:
DF_obj.drop([0, 2],inplace=False)
DF_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [10]:
d2 = DF_obj.drop([0,2],axis = 0)
d2

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [11]:
d3 = DF_obj.drop([0,2],axis=1)
d3

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

### Adding data

In [12]:
# series_obj = Series(np.arange(6))
# series_obj.name = "added_variable"
# series_obj

series_obj = pd.Series(np.arange(6),name="added_variable")
series_obj

0    0
1    1
2    2
3    3
4    4
5    5
Name: added_variable, dtype: int64

In [13]:
# variable_added = DataFrame.join(DF_obj, series_obj)
# variable_added

variable_added = DF_obj.join(series_obj)
variable_added

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [14]:
# append has been deprecated since pandas version 1.4.0. Use pd.concat() instead.
# added_datatable = variable_added.append(variable_added, ignore_index=False)
# added_datatable

added_datatable = pd.concat([variable_added,variable_added],axis=1, ignore_index=False)
added_datatable

,0,1,2,3,4,5,added_variable,0,1,2,3,4,5,added_variable
0,0,1,2,3,4,5,0,0,1,2,3,4,5,0
1,6,7,8,9,10,11,1,6,7,8,9,10,11,1
2,12,13,14,15,16,17,2,12,13,14,15,16,17,2
3,18,19,20,21,22,23,3,18,19,20,21,22,23,3
4,24,25,26,27,28,29,4,24,25,26,27,28,29,4
5,30,31,32,33,34,35,5,30,31,32,33,34,35,5

In [15]:
# append has been deprecated since pandas version 1.4.0. Use pd.concat() instead.
# added_datatable = variable_added.append(variable_added, ignore_index=True)
# added_datatable

added_datatable = pd.concat([variable_added,variable_added],axis=1,ignore_index=True)
added_datatable

   0   1   2   3   4   5   6   7   8   9   10  11  12  13
0   0   1   2   3   4   5   0   0   1   2   3   4   5   0
1   6   7   8   9  10  11   1   6   7   8   9  10  11   1
2  12  13  14  15  16  17   2  12  13  14  15  16  17   2
3  18  19  20  21  22  23   3  18  19  20  21  22  23   3
4  24  25  26  27  28  29   4  24  25  26  27  28  29   4
5  30  31  32  33  34  35   5  30  31  32  33  34  35   5

### Sorting data

In [16]:
# DF_sorted = DF_obj.sort_values(by=(5), ascending=[False])
# DF_sorted

DF_sorted = DF_obj.sort_values(by=[5],ascending=False)
DF_sorted

    0   1   2   3   4   5
5  30  31  32  33  34  35
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

# Task 1: Concatenate DataFrames
You are given two DataFrames representing students in two different classes. Use Pandas to concatenate them into a single DataFrame.

#### Class A:
name,age,grade

Alice,20,A

Bob,21,B

Charlie,22,C


#### Class B:

plaintext

name,age,grade

David,20,B

Eve,22,A

Frank,21,C



1. Create two DataFrames using the data above.

2. Concatenate the two DataFrames along rows.

3. Add a new column called "class" indicating "Class A" or "Class B" for each student.

4. Print the final DataFrame.

In [28]:
data_a = [{'name': 'Alice', 'age': 20, 'grade': 'A'},
        {'name': 'Bob', 'age': 21, 'grade': 'B'},
        {'name': 'Charlie', 'age': 22, 'grade': 'C'}]
DF_a = pd.DataFrame(data_a)
data_b = [{'name': 'David', 'age': 20, 'grade': 'B'},
        {'name': 'Eve', 'age': 22, 'grade': 'A'},
        {'name': 'Frank', 'age': 21, 'grade': 'C'}]
DF_b = pd.DataFrame(data_b)
DF_ab = pd.concat([DF_a,DF_b],axis=0)
DF_ab['Class'] = ['Class A'] * len(DF_a) + ['Class B'] * len(DF_b)
DF_ab

      name  age grade    Class
0    Alice   20     A  Class A
1      Bob   21     B  Class A
2  Charlie   22     C  Class A
0    David   20     B  Class B
1      Eve   22     A  Class B
2    Frank   21     C  Class B


# Task 2: Merge Datasets Based on a Common Column
You are given two DataFrames representing student scores and student email addresses. Use merge to join these DataFrames on the "name" column.

Student Scores:
name,score

Alice,85

Bob,78

Charlie,90

Eve,88

Student Emails:
name,email

Alice,alice@example.com

Charlie,charlie@example.com

Eve,eve@example.com

Frank,frank@example.com

1. Merge the two DataFrames to create a new DataFrame with all columns.

2. Use an inner join to keep only the students who appear in both DataFrames.

3. Print the final merged DataFrame.

In [33]:
data_score = [{'name': 'Alice', 'score': 85},
              {'name': 'Bob', 'score': 78},
              {'name': 'Charlie', 'score': 90},
              {'name': 'Eve', 'score': 88}]
DF_score = pd.DataFrame(data_score)
data_email = [{'name': 'Alice', 'email': 'alice@example.com'},
              {'name': 'Charlie', 'email': 'charlie@example.com'},
              {'name': 'Eve', 'email': 'eve@example.com'},
              {'name': 'Frank', 'email': 'frank@example.com'}]
DF_email = pd.DataFrame(data_email)
DF_merged = pd.merge(DF_score,DF_email,on='name',how='inner')
DF_merged

      name  score                email
0    Alice     85    alice@example.com
1  Charlie     90  charlie@example.com
2      Eve     88      eve@example.com

# Task 3: Transform Columns in a DataFrame
Use the merged DataFrame from Task 2 and perform the following transformations:

1. Add 5 points to each student's score.

2. Create a new column called "pass" that indicates whether the students score is greater than or equal to 80 (True/False).

3. Print the transformed DataFrame.

In [34]:
DF_merged['score'] = DF_merged['score'] + 5
# Create a new column called "pass" that indicates whether the students score is greater than or equal to 80 (True/False).
series_pass = pd.Series(DF_merged['score'] > 80 , name='pass')
DF_merged = DF_merged.join(series_pass)
DF_merged

      name  score                email  pass
0    Alice     90    alice@example.com  True
1  Charlie     95  charlie@example.com  True
2      Eve     93      eve@example.com  True